emacs-org-babel-analysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-26 Sun 17:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs and Org-babel for flaw analysis.</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="tufte.css" type="text/css" />
<meta http-equiv="Content-Security-Policy"  content="default-src 'self'; img-src https://*; child-src 'none';">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs and Org-babel for flaw analysis.</h1>



<div id="outline-container-orgddd7237" class="outline-2">
<h2 id="orgddd7237">Introduction</h2>
<div class="outline-text-2" id="text-orgddd7237">
<p>
I am a long time emacs user, and wanted to automate as much of my workflow as possible.  Just understanding flaws in C can be a time-consuming process, especially when working with large git trees like the kernel. However, Emacs offers a useful tool called org-babel (part of org-mode)  that can help speed up analysis workflows. Org-babel allows you to execute code blocks in Org mode files and capture the results, figures, and tables.  I will work through a fictional flaw in the kernel, because I’m not allowed to share the <b>exact</b> secret sauce of a flaw, but this should be a good starting point.
</p>

<p>
The full file is available here, although I imagine that most people will want to modify it for their own particular use case.
</p>

<p>
I will walk through the file contents, explaining how org-babel works and how it fits the workflow.  A link to the final file is in the Resources section at the bottom of this article.
</p>

<p>
I continually update a template of this file with workflow or things that I need to improve or remember to do, so that I dont make that category of error again.  New ‘investigations’ are created from the template so it means I shouldnt make that mistake again going forward.
</p>

<p>
Rather than switching between Emacs and your terminal, org-babel can run data processing commands like sorting, filtering, and aggregating directly in your Org mode file using org-babel. This avoids the context switching that can slow you down and helps keep your analysis workflow organized in one place.
</p>
</div>
</div>

<div id="outline-container-org7d73c74" class="outline-2">
<h2 id="org7d73c74">File metadata</h2>
<div class="outline-text-2" id="text-org7d73c74">
<p>
Each flaw that is analysed starts from a template, the template contains the a “Org-mode” tree-structured file which where headings can have subheadings.  This allows you to organize the output of my work hierarchically and fold/unfold sections of the tree.
</p>

<p>
Before any of the tree structure there is some file specific metadata:
</p>

<pre class="example" id="org51f999b">

#+TITLE: Evaluation of flaw: **CVE-YYYY-NNNNN**
#+TODO: [_] [✓] [x] [x] [NA]
#+options: num:nil


#+PROPERTY:  header-args:sh  :var FLAWBZ="**CVE-YYYY-NNNNN**"
#+PROPERTY:  header-args:sh+ :var TASKBZ="**BZ-NUMBER**"
#+PROPERTY:  header-args:sh+ :var UPSTREAM_COMMIT="**012345AFFFF**"
#+PROPERTY:  header-args:sh+ :async :exports results
#+PROPERTY:  :LOGGING: nil

</pre>

<p>
This is at the top of each file and requires some explanation.  
</p>

<p>
The :var SOMETHING=”something” is defining a “buffer scoped” variable, inside any of the org-babel code blocks, I can use these variables as it was set when the file was loaded.
</p>

<p>
I keep my “private notes” in the bugzilla bug numbered “TASKBZ” and the the “FLAWBZ” is the bug alias for the CVE flaw.  This page ends up with content that makes an entry on the <a href="https://access.redhat.com/security/security-updates/#/">Red Hat CVE pages.</a>
</p>

<p>
After modifying the org-mode header properties, org-mode must be restarted for the changes to take affect.  Now we introduce the meat and potatoes of org-mode the code-block.
</p>

<p>
To create a code block in org-babel, you use the #+BEGIN_SRC and #+END_SRC lines to delimit the block. On the line after #+BEGIN_SRC, specify the language of your code block. 
</p>

<p>
For example: 
</p>

<pre class="example" id="org2392068">
#+BEGIN_SRC emacs-lisp
(org-mode-restart)
#+END_SRC
</pre>

<p>
Will make mean that any content between BEGIN_SRC and END_SRC is emacs-lisp code and it can be execute  with <b><b>C-c C-c</b></b>.
</p>

<p>
Org-babel caches the results, figures, and tables produced by code blocks, allowing you to quickly review them without having to re-run the code. This is useful when you want to double check something or refer back to an earlier part of your analysis. The cached results save you the time of re-executing the code.
</p>

<p>
In our example, though when we put the cursor inside the code-block and hit <b><b>C-c C-c</b></b>, org-mode will be restarted and the variables changed in the header will immediately take affect.
</p>
</div>
</div>
