emacs-org-babel-analysis.org
*  The power of the checklist.

Its easy to forget things, I know as I do it all the time.  Many people [preach the power of checklists](http://atulgawande.com/book/the-checklist-manifesto/) , it minimises mistakes because I need to ensure that each checklist item is at least acknowledged as being done, undone or invalid.  I use each item in org-modes tree structure as a checklist item, and checklists can have subchecklists, etc.   This reduced errors in my analysis by approximately 22.5% .  I know this because each flaw is being checked by another engineer inside the Red Hat product security group.

I start by reading through the upstream commit that either fixes the flaw or the any kind of analysis done either the reporter or myself.

This is my first checklist item, did I read it and explain the flaw.

#+BEGIN_EXAMPLE
 * [_] Briefly explain the flaw in your own words and discuss its severity.
#+END_EXAMPLE

This is prefixed with the asterix as it s a heading, adn the [_] is one of the possible ‘states’ that this checklist item is in, it starts in the ‘unknown’ state.   This is a top-level tree element with no branches.  Usually I’d write a quick description like this below the checklist item.  

#+BEGIN_EXAMPLE
This flaw appears to be a flaw in the management of the multiplication overflow
when a user can specify x,y,z in conditions m.  This can incorrectly create a
condition where writes allocation may end up being less than expected, but when
written to can overwrite memory as these requests end up being in kernel memory.

This error is in the fictional fake_function in fs/fake-read-only-no-block-device.c
#+END_EXAMPLE

Its not always right, but its a start.    When i’m done i hit C-c C-t and it changes it from the ‘unknown’ state to the Ticked state, looking good.  

The next thing we do is identify which part of the kernel source code that this affects.  Usually you can get a pretty good idea from where it is reported, lets say its in the fictional file fs/fake-read-only-no-block-device.c

We should start of to see if this code is built for any of the released kernels.   I have each of the kernel sources for each release of the linux checked out on an NVME disk because I do often need to grep large chunks checkouts and NVME ends up making the interactions much faster.

#+BEGIN_EXAMPLE
 * [_] Which kernels include this faulty code ?
#+END_EXAMPLE

The kernel build process uses CONFIG directives in build files to set which code is built. Each CONFIG directives allow selecting specific kernel options and features, and based on which options are selected, the corresponding code is compiled into the kernel. By determining which CONFIG options enable the faulty code in fs/fake-read-only-no-block-device.c, we can determine which kernel versions will contain this flaw.

The general rule of thumb is that if file exists in fs, you can see the CONFIG directive that builds it by looking in the Makekfile in the same directory.  This is not always the case, sometimes it may be the prent directory, but its frequently the case.

#+BEGIN_EXAMPLE
 ** [_] Upstream
 :PROPERTIES:
 :header-args:sh+: :dir "/home/wmealing/fast/linux/"
 :END:
#+END_EXAMPLE

This is a child node of the above, which usually right below it has the following org-babel block:

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :exports both
cat fs/Makefile | grep -B 2 -A 2 fake-read-only-no-block-device.c
#+END_SRC

#+RESULTS
CONFIG_SOMETHING:= fake-read-only-no-block-device.o
#+END_EXAMPLE

When executed (C-c C-c), this codeblock executes some ‘bash’,  (I prefer this to colorful zfs, etc) and will usually show the CONFIG_SOMETHING option that is used to build the option into the kernel.

For good habit, I manually check this and dont export it to a variable, because it can be a little tricky to correctly parse the Kbuild structure, but it quickly becomes obvious after doing this a few times.

I then explicitly export the variable for use in future code blocks by execute a “named” codeblock and the ouput is saved as the variable CONFIG_DIRECTIVE

 

#+BEGIN_EXAMPLE
#+name: CONFIG_DIRECTIVE
#+BEGIN_SRC sh :exports none
echo -n "CONFIG_SOMETHING"
#+END_SRC

#+RESULT
CONFIG_SOMETHING
#+END_EXAMPLE

Now we break this down into specific releases. I will cover fedora and rhel-9 as two examples, the other RHEL releases are similar but have different default settings that are more relevant to the lifecycle.

#+BEGIN_EXAMPLE
 ** [_] Fedora
 :PROPERTIES:
 :header-args:sh+: :dir "/home/wmealing/fast/fedora/"
 :END:
#+END_EXAMPLE

This contains the current fedora kernel checked out from git, along with the “.config” files used to set build directives.  These files are ‘vendor driven’ which end up making the build time configuration of the kernel.  Fortunately they are pretty sanely set out so searching them isnt a big deal.

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :results verbatim  :exports results :cache yes :var config=CONFIG_DIRECTIVE
grep -R  "$config=" /home/wmealing/fast/fedora/redhat/configs/*  
#+END_SRC

#+RESULT:
CONFIG_SOMETHING=y
#+END_EXAMPLE

This will usually return a value if its set, these seem to be pretty consistent across most kernel releases, however there are times when CONFIG_ directives have changed names for whatever reason.

If Fedora kernels include the build option, now it is time to check to see if it includes the bug.

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :exports both :async :cache yes :var config=CONFIG_DIRECTIVE
git grep -W 'broken_function_name' *.c 
#+END_SRC

#+RESULT:
int broken_function_name(void) {
  /* This is the broken function contents */

  int a;
  int c;

  called_this();
  
}
#+END_EXAMPLE

This will search through all files ending in .c , but if you wanted to reduce the time you could explicitly point to the file, youc an also pipe the command through ‘head’ and or ‘tail’ shell commands if only part of the function is needed.

Now i would mark it affected or unaffected.  I use a tool which I’m not allowed to talk about, but very equivalent tooling can be completed with the wonderful [python-bugzilla tool.](https://github.com/python-bugzilla/python-bugzilla)



#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :exports both :async :cache yes :var config=CONFIG_DIRECTIVE
 sfm2 $FLAWBZ fedora/kernel=affected,fix
#+END_SRC
#+END_EXAMPLE

Once I’m done i hit **C-c C-t**, and the tickbox in the “Fedora” is then set. 

And the same for Red Hat Enterprise LInux 9.

#+BEGIN_EXAMPLE
 ** [_] Red Hat Enterprise Linux 9
 :PROPERTIES:
 :header-args:sh+: :dir "/home/wmealing/fast/rhel-9/"
 :END:
#+END_EXAMPLE

The below shell is automatically run from within the :dir directory setting as set in the “rhel-9”  draw above.

I dont include the result in the template, but an example is shown below so you can see what the output kinda would look like.

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :exports both :async :cache yes 
git grep -W 'broken_function_name' *.c 
#+END_SRC

#+RESULT:
int broken_function_name(void) {
  /* This is the broken function contents but its rhel9 code.*/

  int a;
  int c;

  BUG();
 
return 0; 
}
#+END_EXAMPLE

Another useful feature of org-babel is the ability to parameterize code blocks. Parameters allow you to pass variables and options to the code block, without having to edit the code itself. This avoids wasted time rewriting and re-testing code when you want to try different inputs or options.

Now usually, i’d write a reproducer that exercises this code, so that i can make the system crash or execute a specific payload.  I’m not going to provide an example reproducer, but this should be enough to get someone interested in the workflow.  Releasing exploit code publicly before a fix is available can be dangerous because it alerts malicious actors to the vulnerability, giving them an opportunity to exploit systems before administrators have had time to apply patches.. It is generally advisable to disclose vulnerabilities to vendors privately and give them time to develop and release a fix before publishing exploit details publicly.

I also make the reproducer in org-babel, I did at one point have this “[tangling](https://orgmode.org/manual/Extracting-Source-Code.html)” but I had since changed back to the following bash snippet to get my reproducer.

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :exports both :var FLAWBZ=$FLAWBZ :cache yes 
cat << EOF > ~/reproducers/$FLAWBZ.c

#include <stdio.h>

int main(void) {

	// write exploit() here.

	return 0;
}
EOF

gcc -static  ~/reproducers/$FLAWBZ.c -o ~/builds/$FLAWBZ
#+END_SRC
#+END_EXAMPLE

This creates the reproducer and builds it in one step, I usually try to keep this as short as possible, but it can end up being hundreds of lines.  This is complied statically so that the same binary can be executed across different releases without having to recompile.

After creating the reproducer, we should deploy and test it in the specific environment to confirm findings.    

First I need to reserve a system.


#+BEGIN_EXAMPLE
#+NAME: reserved-system
#+BEGIN_SRC sh :exports both :var FLAWBZ=$FLAWBZ  :cache yes 
SYSTEM=`system-reserve rhel-9 5.14.0-162.6.1`
scp ~/builds/$FLAWBZ $SYSTEM
ssh $SYSTEM ~/$FLAWBZ
#+END_SRC
#+END_EXAMPLE

Sometimes i break this up into two blocks if i need a quicker  build/test .

Finally, i mark the release affected.


#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :exports both :var FLAWBZ=$FLAWBZ  :cache yes 
 sfm2 $FLAWBZ rhel-9/kernel=affected,fix
 sfm2 $FLAWBZ rhel-9/kernel-rt=affected,fix
#+END_SRC
#+END_EXAMPLE

This uses the sfm2 command is a tool created internally to modify the bugzilla state.  Equivalent functionality can be achieved by manipulating the relevant bug tracker (in this case bugzilla with https://github.com/python-bugzilla/python-bugzilla ) sfm2 can manipulate most of bugzillas tooling, howeve[r it will be replaced with OSIDB soon.](https://www.openhealthnews.com/story/2022-12-16/new-generation-tools-open-source-vulnerability-management)

Both kernel and kernel-rt have very similar -build- CONFIG_ directives, but if i dont see the CONFIG_ directive for kernel-rt, I dont consider it affected (I rarely see this unless a flaw is architecture specific)

