emacs-org-babel-analysis.org
* All other releases

Each release of Red Hat Enterprise Linux has a heading that points to a directory of the current git trees used to build that version of RHEL

Some releases require special handling, as they are in different parts of the product lifecycle, I set sensible defaults in the template to ensure that less time is wasted when new flaws are created.  Some releases are removed when they are no longer supported.

* Setting the CVSS.


The CVSS score is commonly shared between different vulnerability databases, NVD/Mitre can often score flaws different to Red Hat, if there is a difference I should email them and explain why as they may not have the same understanding of the flaw.  I have disagreed with NVD approximately 32 times in my entire time, they have modified their flaws with this new rating 30 times.



#+BEGIN_EXAMPLE

 * [_] Setting the CVSS score

  Current CVSS score:

  #+BEING_SRC sh :export results
  sfm2 flaw $FLAWBZ | grep CVSSv3
  #+end_src

  #+BEING_SRC sh :export results
  sfm2 flaw $FLAWBZ CVSSv3 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
  #+end_src

#+END_EXAMPLE

This shows the current cvssv3 score, and then you can set the score immediately after if it is not completed.  I just remove the last code block, if its not necessary, then i mark the scoring task as done (C-c C-t).

## Fixed in upstream:

NVD for some reason ask Red Hat to submit where things are fixed in upstreams release (As a rule all fixes must be upstreamed before being included in the kernel, this way everyone wins) so for some reason it falls to me to chase that down, even though we never ship ‘upstream’ code.


#+BEGIN_EXAMPLE
 ** [_] Upstream fixed in version.
 :PROPERTIES:
 :header-args:sh+: :dir "/home/wmealing/fast/linux/"
 :END:
#+END_EXAMPLE


Once again we use the :dir option to infuence the children code-blocks (Think of the CHILDREN!) so that it runs against the upstream kernel source.  I need to find the commit that fixed this flaw, if I dont have it already, or if its fixed in various trees or have incorrect information I need to consult the source.  I use gits ‘blame’ feature which annotates each line with useful metata.


#+BEGIN_EXAMPLE
#+begin_src sh :dir ~/fast/linux :exports results
git blame fs/fake-read-only-no-block-device.c  |grep -A5 -B5 'identifier'
#+end_src

#+RESULTS:
...
^72FG2AF (Some Coder 2022-07-03 06:55:55 -0300  7)  *p = container_of(ptr_a); 
...
#+END_EXAMPLE

I include an identifier that i know is usually in the patch, usually part of one of the lines where I know there is a problem.   The commit identifier ( 72FG2AF ) can be then used to find out which tag introduced this problem.

I did have some trickery written to pull the commit ID off the line, but it ended up being more work thatn it was worth, so i input it now, every time.


#+BEGIN_EXAMPLE
#+begin_src sh :exports results :dir ~/fast/linux
git tag --contains 72FG2AF
#+END_SRC

#+RESULTS:

v5.14rc2
#+END_EXAMPLE

So, i’d then set it with the command:

#+BEGIN_EXAMPLE
#+begin_src sh
sfm2 flaw $FLAWBZ change --fixed-in "kernel v5.14-rc2"
#+end_src
#+END_EXAMPLE

* Other workflow and exporting data.

There are significant number of other checklist items that I have not covered here, that you can see in the demonstration template.  The large number of items that I had to remember made it obvious to me that checklisting and automation was the only way to reduce mistakes and increase the quality.

Once all of the checklist items were complete, I would use the [org-export](https://orgmode.org/manual/Exporting.html) functionality to export a UTF-8 text file (Gotta preserve those tickboxes) for manually pasting into bugzilla. I did have some automation setup for this, however it was a little unwieldly and copy-and-paste into bugzilla meant that I knew it got there reliably.

* Conclusion

Org-babel makes it easy to interleave text, code, and the results of running that code. This integrated workflow reduces the time spent switching between editing text, running code, and reviewing the results. You can focus on telling a coherent story with your data analysis without disruptive context switches.

In conclusion, org-babel offers these benefits that can speed up your data analysis workflow:

1. Execute data processing commands directly in Org mode
2. Cache results, figures, and tables for fast access
3. Integrate text, code, and results in a seamless workflow
By taking advantage of these org-babel features, you can significantly reduce the time spent analyzing your data and focus on gaining key insights.

The seamless mix of ‘my local context’ and the checklist requirements and process required to complete the task allows me to reduce the time that I take between flaws down by 45 minutes on average, along with significantly lower error rates.

I have yet to see tooling written that ensures a reliable workflow to build a report that shows the logical path taken to understand a security flaw to resolution through the maintenance process.     Maybe it can be done, I just haven’t seen anyone else do this.

If you have structured work that repeats commonly , I would strongly suggest looking into org-babel to smooth out any rough parts of your workflow, and let you spend your time on solving the issue, not dealing with process.

* Resources:

 - [[https://orgmode.org/worg/org-contrib/babel/intro.html][Org-babel introduction]]
 - [[https://orgmode.org/manual/Environment-of-a-Code-Block.html][Environment of a Code Block]]
 - [[file:template-flaw.org][Template Flaw]]
